export const SPORT = 'sport'
export const WALKS = 'walks'
export const REST = 'rest'
export const FUN = 'fun'
export const ALL = 'all'

export const wakesurf = {
    id: 'wakesurf',
    name: 'Вейксёрф',
    image: {
        url: 'surf',
        size: 250
    },
    activityLevel: 3,
    money: 3000,
    description: "Cимуляция классического сёрфинга. Катер-буксировщик тянет райдера за собой и создает волны разной длины. Ваша задача удержаться на специальной доске и получить удовольствие!\n",
    category: SPORT,
}

export const horses = {
    id: 'horses',
    name: 'Конный спорт',
    image: {
        url: 'horse',
        size: 150
    },
    activityLevel: 2,
    money: 1500,
    description: "Сто лет назад катание на лошади было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: WALKS,
}

export const boardGames = {
    id: 'boardGames',
    name: 'Настолки',
    image: {
        url: 'games',
        size: 200
    },
    activityLevel: 1,
    money: 700,
    description: "Сто лет назад катание на настолках было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: FUN,
}

export const masterClasses = {
    id: 'masterClasses',
    name: 'Мастер-классы',
    image: {
        url: 'cook',
        size: 200
    },
    activityLevel: 1,
    money: 2000,
    description: "Сто лет назад катание на мастер-классах было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: REST,
}

export const planetarium = {
    id: 'planetarium',
    name: 'Планетарий',
    image: {
        url: 'planets',
        size: 200
    },
    activityLevel: 1,
    money: 500,
    description: "Сто лет назад катание на планетарии было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: REST,
}

export const tea = {
    id: 'tea',
    name: 'Чайная церемония',
    image: {
        url: 'tea',
        size: 150
    },
    activityLevel: 1,
    money: 500,
    description: "Сто лет назад катание под чаем было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: REST,
}

export const rockClimbing = {
    id: 'rockClimbing',
    name: 'Скалолазание',
    image: {
        url: 'rock',
        size: 150
    },
    activityLevel: 3,
    money: 700,
    description: "Сто лет назад катание вниз со скалы было для большинства в Спарте обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: SPORT,
}

export const laserTag = {
    id: 'laserTag',
    name: 'Лазертаг',
    image: {
        url: 'lasers',
        size: 200
    },
    activityLevel: 2,
    money: 1000,
    description: "Сто лет назад катание на лазертаге было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: FUN,
}

export const karting = {
    id: 'karting',
    name: 'Картинг',
    image: {
        url: 'karting',
        size: 170
    },
    activityLevel: 2,
    money: 2000,
    description: "Сто лет назад катание на картах было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: FUN,
}

export const sauna = {
    id: 'sauna',
    name: 'Сауна',
    image: {
        url: 'sauna',
        size: 150
    },
    activityLevel: 1,
    money: 2000,
    description: "Сто лет назад катание в сауне было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: REST,
}

export const stretching = {
    id: 'stretching',
    name: 'Стретчинг',
    image: {
        url: 'stretching',
        size: 150
    },
    activityLevel: 2,
    money: 1000,
    description: "Сто лет назад катание на стретчинге было для большинства обычным навыком, а заодно и развлечением. Сегодня умением держаться в седле могут похвастаться немногие. А между тем конный спорт — один из самых полезных видов физической нагрузки, к тому же он даёт возможность пообщаться с лошадьми. Представляем вам список конно-спортивных клубов Москвы и ближайшего Подмосковья.",
    category: SPORT,
}

export const allActivities = [
    wakesurf, horses, boardGames, masterClasses, planetarium, tea, rockClimbing, laserTag, karting, sauna, stretching
]

export const activityByName = (name: string) => {
    return allActivities.filter(activity => activity.id === name)[0]
}
